from aiogram import types
from aiogram import Dispatcher
from aiogram.filters import Command

async def cmd_tariffs(message: types.Message):
    """
    Хендлер, который выводит информацию по всем тарифам (free, base, advanced, test)
    и описывает их преимущества.
    """


    text = (
         "<b>Тарифы и преимущества</b>\n\n"

    "1. <b>Free</b> 🆓\n"
    "   • 🛍 Отслеживание заказов, выкупов, отказов и возвратов\n"
    "   • 🏬 Возможность подписаться только на 1 склад (бесплатная поставка)\n"
    "   • 🌐 Позиция вашего товара по артикулу и ключевому запросу\n"
    "   • 📊 Сводная статистика ограничена коротким периодом (7 дней)\n\n"

    "2. <b>Base</b> 🔑\n"
    "   • Всё из free, плюс:\n"
    "   • 🚚 Отслеживание заказов и выкупов в реальном времени за 30 дней\n"
    "   • 🏬 До 3 складов (бесплатная поставка)\n"
    "   • 📈 Сводная статистика (Excel) за период до 30 дней\n\n"

    "3. <b>Advanced</b> 🚀\n"
    "   • Всё из base, плюс:\n"
    "   • ⏳ Отслеживание заказов до 90 дней\n"
    "   • 🏬 До 9 складов (бесплатная поставка)\n"
    "   • 🌐 Позиция вашего товара по артикулу и ключевому запросу по 20 городам (Excel)\n"
    "   • 🔑 Показывает ваши ключи и их частотность (Excel)\n"
    "   • 🗺 Контроль остатков по городам (Excel)\n"
    "   • 📑 Удобная сводная информация сразу в нескольких Excel-таблицах\n\n"

    "4. <b>Test</b> 🧪\n"
    "   • Тестовый тариф с функционалом уровня advanced\n"
    "   • Можно использовать для ознакомления со всеми возможностями\n"
    "   • 🏬 До 9 складов (бесплатная поставка)\n\n"

    "<b>Общее для всех тарифов:</b>\n"
    "   • ✅ Отслеживание бесплатного коэффициента поставки (уведомления)\n"
    "   • ✅ Отслеживание позиции товара по ключевому запросу\n"
    "   • ✅ Сводная статистика и отчёты в формате Excel\n"
    "   • ✅ Реальное время обновления данных и уведомлений\n\n"

    "Если у вас остались вопросы или нужна помощь по выбору тарифа, напишите нам в <b>Поддержку</b>🤝(/help)"
    )

    await message.answer(text, parse_mode="HTML")


def register_tariffs_handler(dp: Dispatcher):
    dp.message.register(cmd_tariffs, Command("tariffs"))
